app/views/banks/index.html.erb

SELECT  "banks".* FROM "banks" ORDER BY "banks"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "banks"
---
  <div class="col-7">
  <% if Bank.count < 1 %>

SELECT  "banks".* FROM "banks" LIMIT $1  [["LIMIT", 11]]
---
  <% else %>
    <td><%= link_to 'Редактировать настройку', edit_bank_path(Bank.first), class: 'btn btn-outline-dark ' %></td>