app/views/users/index.html.erb

SELECT COUNT(*) FROM "users"
---
    <h2>Users</h2>
      <small>Всего - <%= User.count %></small>