app/views/orders/index.html.erb

    <h2>Заказы</h2>
      <small>Всего - <%= Order.count %></small>
---
SELECT "orders".* FROM "orders"
SELECT COUNT(*) FROM "orders"