app/controllers/banks_controller.rb

  def index
    @banks = Bank.all
---
SELECT  "banks".* FROM "banks" ORDER BY "banks"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    @bank = Bank.new(bank_params)

    respond_to do |format|
      if @bank.save
---
INSERT INTO "banks" ("app_type", "app_address", "bank_shop_id", "bank_shop_id_test", "ins_password", "ins_success_url", "ins_fail_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @bank.update(bank_params)
---
UPDATE "banks" SET "bank_shop_id" = $1, "bank_shop_id_test" = $2, "updated_at" = $3 WHERE "banks"."id" = $4  [["bank_shop_id", "8449d490-cc9a-44f1-8dd3-428da0af046e"], ["bank_shop_id_test", "30d7d5d1-ec42-49ab-aa11-458cda4be9c9"], ["updated_at", "2021-10-10 13:31:42.066677"], ["id", 1]]

    def set_bank
      @bank = Bank.find(params[:id])
---
SELECT  "banks".* FROM "banks" WHERE "banks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]