app/controllers/orders_controller.rb

  def index
    @search = Order.ransack(params[:q])
    @search.sorts = 'id asc' if @search.sorts.empty?
    @orders = @search.result.paginate(page: params[:page], per_page: 30)
---
SELECT "orders".* FROM "orders"
SELECT COUNT(*) FROM "orders"
SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE "orders" SET "status" = $1, "ip" = $2, "updated_at" = $3 WHERE "orders"."id" = $4  [["status", ""], ["ip", ""], ["updated_at", "2021-10-02 15:19:26.935159"], ["id", 1]]

  def checkout
    test = Bank.first.app_type
    bank_shop_id = test ? Bank.first.bank_shop_id_test : Bank.first.bank_shop_id
    payment_url = test ? "https://payment.test.maksekeskus.ee/pay/1/link.html" : "https://payment.maksekeskus.ee/pay/1/link.html"

    return_url_data = Bank.first.app_address+"/orders/payment&rerturn_method=GET"
    cancel_url_data = Bank.first.app_address+"/orders/payment&cancel_method=GET"
    notification_url_data= Bank.first.app_address+"/orders/payment&notification_method=GET"

    if params[:key].present?
      order_data = {
        order_id: params[:order_id],
        shop_id: params[:shop_id],
        amount: params[:amount],
        transaction_id: params[:transaction_id],
        key: params[:key],
        description: params[:description],
        phone: params[:phone],
        email: params[:email],
        signature: params[:signature]
      }
      puts "order_data - "+order_data.to_s
      check_order = Order.find_by_order_id(order_data[:order_id])
      if check_order.present?
        check_order.update(order_data)
        order = check_order
      else
        order = Order.create(order_data)
---
SELECT  "banks".* FROM "banks" ORDER BY "banks"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."order_id" = $1 LIMIT $2  [["order_id", "50387569"], ["LIMIT", 1]]
SELECT  1 AS one FROM "orders" WHERE "orders"."order_id" = $1 AND "orders"."id" != $2 LIMIT $3  [["order_id", "50387569"], ["id", 28], ["LIMIT", 1]]
UPDATE "orders" SET "amount" = $1, "transaction_id" = $2, "signature" = $3, "updated_at" = $4 WHERE "orders"."id" = $5  [["amount", "1.0"], ["transaction_id", "12892019"], ["signature", "2312e08581d1e4964400d95d33c8af98"], ["updated_at", "2021-10-05 12:54:00.001514"], ["id", 3]]
INSERT INTO "orders" ("shop_id", "amount", "transaction_id", "key", "description", "order_id", "phone", "email", "signature", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def payment
    puts "Параметры payfail"
    payment_data = JSON.parse( params["json"])

    if payment_data["status"] == "CANCELLED"
      test = Bank.first.app_type
      search_order = test ? payment_data["paymentId"] : payment_data["reference"]

      order = Order.find_by_order_id(search_order)
      order.update!(status: 'CANCELLED')
---
SELECT  "banks".* FROM "banks" ORDER BY "banks"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."order_id" = $1 LIMIT $2  [["order_id", "50387569"], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", "CANCELED"], ["updated_at", "2021-10-06 14:51:32.107552"], ["id", 24]]

  def status
    order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

    def set_order
      @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."order_id" = $1 LIMIT $2  [["order_id", "50387569"], ["LIMIT", 1]]