app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
---
  def index
    @search = User.ransack(params[:q])
    @search.sorts = 'id asc' if @search.sorts.empty?
    @users = @search.result.paginate(page: params[:page], per_page: 30)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users"
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
  def destroy
    @user = User.find(params[:id])
    if (User.count > 1) && !@user.admin?
      @user.destroy!